USE cd;
/*изменяет разделитель SQL-команд с стандартной точки с запятой (;) на //, 
что позволяет внутри SQL-скрипта использовать более сложные блоки кода, 
такие как определения хранимых процедур и триггеров, без возможных конфликтов с обычным разделителем.*/
DELIMITER //

CREATE PROCEDURE AddPaidColumn() /*начинает процесс создания новой хранимой процедуры с именем AddPaidColumn.*/
BEGIN
    /*Попытка добавить столбец без проверки его существования*/
    BEGIN
        DECLARE CONTINUE HANDLER FOR SQLSTATE '42S21' BEGIN END; /*обработчик ошибок будет перехватывать ошибку с кодом состояния SQL '42S21'. В данном случае, код '42S21' относится к ошибке о том, что столбец, который вы пытаетесь добавить, уже существует в таблице. Оператор DECLARE CONTINUE HANDLER создает обработчик для данной ошибки SQLSTATE, и после его объявления следует блок */
        ALTER TABLE bookings ADD COLUMN paid BOOLEAN DEFAULT FALSE; /*После объявления обработчика ошибок происходит операция добавления нового столбца "paid" в таблицу "bookings" с типом данных BOOLEAN и значением по умолчанию FALSE. Однако, благодаря наличию обработчика ошибок, если столбец "paid" уже существует в таблице "bookings", операция ALTER TABLE не приведет к срабатыванию ошибки, и выполнение кода продолжится дальше, минуя эту ошибку.*/
    END;
END //

DELIMITER ; /* возвращает стандартный разделитель (;) для SQL-запросов.*/

-- Вызываем процедуру
CALL AddPaidColumn(); /*вызов процедуры AddPaidColumn запускает процедуру, которая пытается добавить столбец "paid" в таблицу "bookings".*/

/*Триггер для предотвращения удаления оплаченных бронирований*/
DELIMITER //
CREATE TRIGGER PreventDeletePaidBookin
BEFORE DELETE ON bookings
FOR EACH ROW
/*создается триггер с именем PreventDeletePaidBookin, который предотвращает удаление оплаченных бронирований из таблицы "bookings". 
Триггер активируется перед операцией DELETE ON для каждой строки (FOR EACH ROW).*/
BEGIN
    IF OLD.paid THEN /*условие проверяет значение столбца "paid" в строке, которая будет удалена. Ключевое слово OLD используется для обращения к старому значению строки перед ее удалением. Если значение столбца "paid" равно TRUE, то выполняются дальнейшие действия.*/
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Cannot delete paid bookings';
        /*генерация сигнала (SIGNAL), который является механизмом возбуждения ошибок или уведомлений в теле триггера. Код состояния SQL, указанный как '45000', представляет общую категорию "unhandled user-defined exception" (необработанное пользовательское исключение). 
        Затем устанавливается текст сообщения об ошибке как 'Cannot delete paid bookings'*/
    END IF;
END //
DELIMITER ;
