USE cd;
/*Task-7-1: Создаем функцию для расчета стоимости аренды*/
/*вместо точки с запятой будет использоваться // как разделитель команд.*/
DELIMITER //
CREATE FUNCTION CalculateRentalCost(bookID INT) RETURNS DECIMAL(10, 2) DETERMINISTIC ADD
/*начинает процесс создания новой функции. Она указывает на то, что функция называется "CalculateRentalCost", 
принимает один аргумент типа INT и возвращает DECIMAL(10, 2). 
Ключевое слово DETERMINISTIC указывает на то, что функция будет возвращать одинаковый результат для одних и тех же входных данных.*/
BEGIN /*начало тела функции.*/
    DECLARE cost DECIMAL(10, 2); /* создается переменная "cost" типа DECIMAL(10, 2) для хранения рассчитанной стоимости.*/
    SELECT (slots * CASE WHEN memid IS NULL THEN guestcost ELSE membercost END) INTO cost /*вычисляет стоимость аренды на основе количества слотов и типа клиента (член или гость). Результат помещается в переменную "cost".*/
    /*конструкция CASE, которая проверяет, имеет ли клиент memid (идентификатор члена) значение NULL. Если memid равен NULL, 
    то используется значение guestcost (стоимость для гостя), в противном случае используется значение membercost (стоимость для члена).*/
    FROM bookings
    WHERE bookid = bookID; /*извлекает данные из таблицы "bookings" по конкретному идентификатору бронирования (bookID), который должен быть передан в качестве аргумента при вызове функции "CalculateRentalCost"*/
    RETURN cost; /*Эта строка возвращает значение переменной "cost" как результат работы функции.*/
END; /*конец тела функции.*/
//
DELIMITER ; /*возвращает стандартный разделитель (;) для SQL-запросов.*/

