USE cd;
/*Task-6-7. Подсчитайте количество участников, чья фамилия начинается на определенную букву, отсортировав по буквам в порядке убывания.*/
SELECT substr(surname, 1, 1) AS fl, COUNT(*)
  FROM members
  GROUP BY fl
  ORDER BY fl DESC;
/* - substr(surname, 1, 1) - функция, которая извлекает первую букву фамилии из поля "surname" в таблице "members".

- AS fl - ключевое слово "AS" используется для создания псевдонима "fl" для выражения substr(surname, 1, 1), позволяя обращаться к нему по этому имени в результирующем наборе данных.

- COUNT(*) - функция, которая подсчитывает количество записей в каждой группе.

- FROM members - указывает, что данные будут извлечены из таблицы "members".

- GROUP BY fl - оператор, который группирует строки по значению поля с псевдонимом "fl", то есть первой букве фамилии.

- ORDER BY fl DESC - это оператор, который сортирует результаты по псевдониму "fl" в порядке убывания (от Z до A).*/