USE cd;
/*Task-6-1. Выберите начальное и конечное время последних 10 аренд  объектов, упорядочив их по времени их окончания.*/
SELECT b.starttime, ADDTIME(b.starttime, SEC_TO_TIME(slots*1800))
  FROM bookings b
  ORDER BY 2 DESC
  LIMIT 10
/*Этот запрос SELECT выбирает начальное и конечное время последних 10 аренд объектов, упорядочив их по времени их окончания. */
/*Во внутренней части запроса производится сложение времени начала бронирования (starttime) с длительностью (slots*1800)*/
/*используем функцию ADDTIME для определения времени окончания бронирования*/
/*результат сортируется по второй колонке (времени окончания) в порядке убывания и ограничивается 10 результатами.*/
